In [1]:
import numpy as np 
import pandas as pd

In [4]:
df=pd.read_csv("income.csv",names=["name","income"],skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [5]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

# removing outliers using quantile

In [8]:
df.income.quantile(0)

np.float64(4000.0)

In [11]:
# 25th percentile value 
df.income.quantile(0.25)

np.float64(5500.0)

In [13]:
# 50th percentile value (median)
df.income.quantile(0.5)

np.float64(7000.0)

In [14]:
# 75th percentile vaalue 
df.income.quantile(0.75)

np.float64(7750.0)

In [15]:
percentile_99=df.income.quantile(0.99)
percentile_99

np.float64(9400479.999999994)

In [16]:
# get the outlier records 
df[df.income>percentile_99]

        name    income
6  Elon Musk  10000000

In [20]:
# dataset without outliers 
new_df=df[df.income<percentile_99]
new_df

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [22]:
df['income'][3]=np.nan
df

C:\Users\asus\AppData\Local\Temp\ipykernel_6124\126302786.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.nan

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [25]:
avg_income=df.income.mean()
avg_income

np.float64(1671666.6666666667)

In [27]:
# using mean is not a good solution here due to outliers
df_new=df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [29]:
# using median to fill nan values 
df_new=df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0